{"word_to_stem":{"":"","serve_rag":"serve_rag","py":"py","search":"search","relevant":"relev","code":"code","locations":"locat","without":"without","generation":"generat","return":"return","file":"file","paths":"path","line":"line","ranges":"rang","rerank":"rerank","scores":"score","_maybe_init_hf_pipeline":"_maybe_init_hf_pipelin","get_reranker":"get_rerank","initialize":"initi","retrieve":"retriev","hugging":"hug","face":"face","pipeline":"pipelin","reranker":"rerank","text":"text","classification":"classif","ranking":"rank","tasks":"task","config_loader":"config_load","load_repos":"load_repo","load":"load","repository":"repositori","configuration":"configur","from":"from","json":"json","environment":"environ","variables":"variabl","choose_repo_from_query":"choose_repo_from_queri","selects":"select","most":"most","based":"base","query":"queri","string":"string","using":"use","keyword":"keyword","matching":"match","app":"app","runs":"run","uvicorn":"uvicorn","server":"server","rag":"rag","application":"applic","configurable":"configur","settings":"set","faxbot_rag":"faxbot_rag","hybrid_search":"hybrid_search","_get_embedding":"_get_embed","generates":"generat","embeddings":"embed","input":"input","different":"differ","embedding":"embed","models":"model","_load_cards_map":"_load_cards_map","loads":"load","card":"card","data":"data","jsonl":"jsonl","returns":"return","mappings":"map","between":"between","indices":"indic","chunk":"chunk","ids":"id","metadata":"metadata","search_routed_multi":"search_routed_multi","searches":"search","snippets":"snippet","across":"across","multiple":"multipl","variants":"variant","reranks":"rerank","results":"result","_should_index_file":"_should_index_fil","_prune_dirs_in_place":"_prune_dirs_in_plac","filter":"filter","out":"out","unwanted":"unwant","files":"file","directories":"directori","indexing":"index","filtering":"filter","env_model":"env_model","eval_loop":"eval_loop","run_eval_with_results":"run_eval_with_result","evaluation":"evalu","detailed":"detail","including":"includ","accuracy":"accuraci","metrics":"metric","hit":"hit","information":"inform","main":"main","watch_mode":"watch_mod","save_baseline":"save_baselin","compare_with_baseline":"compare_with_baselin","loop":"loop","optional":"option","baseline":"baselin","comparison":"comparison","watching":"watch","capabilities":"capabl","build_cards":"build_card","mcp_server_http":"mcp_server_http","_blocked":"_block","blocks":"block","legacy":"legaci","chat":"chat","completions":"complet","api":"api","usage":"usag","redirects":"redirect","responses":"respons","sitecustomize":"sitecustom","langgraph_app":"langgraph_app","should_use_multi_query":"should_use_multi_queri","retrieve_node":"retrieve_nod","determine":"determin","multi":"multi","approach":"approach","should":"should","used":"use","retrieval":"retriev","documents":"document","question":"question","context":"context","generate_node":"generate_nod","response":"respons","citations":"citat","fallback":"fallback","fallback_node":"fallback_nod","provides":"provid","when":"when","local":"local","insufficient":"insuffici","generating":"generat","answer":"answer","build_graph":"build_graph","rewrite_query":"rewrite_queri","route_after_retrieval":"route_after_retriev","builds":"build","compiles":"compil","state":"state","graph":"graph","processing":"process","conditional":"condit","routing":"rout","redis":"redi","checkpointer":"checkpoint","eval_rag":"eval_rag","evaluates":"evalu","performance":"perform","comparing":"compar","expected":"expect","actual":"actual","golden":"golden","dataset":"dataset","language":"languag","specific":"specif","parsing":"pars","utilities":"util","analysis":"analysi","ast_chunker":"ast_chunk","collect_files":"collect_fil","collects":"collect","list":"list","given":"given","root":"root","excluding":"exclud","specified":"specifi","patterns":"pattern","metadata_enricher":"metadata_enrich","enrich":"enrich","enriches":"enrich","content":"content","summary":"summari","keywords":"keyword","external":"extern","vivified_rag":"vivified_rag","chat_cli":"chat_c","chatcli":"chatc","entry":"entri","point":"point","cli":"cli","initializes":"initi","dependencies":"depend","starts":"start","interface":"interfac","qdrant_recreate_fallback":"qdrant_recreate_fallback","recreate_collection_safe":"recreate_collection_saf","qdrantclient":"qdrantclient","safely":"safe","recreates":"recreat","qdrant":"qdrant","collection":"collect","error":"error","handling":"handl","index_repo":"index_repo","embed_texts_voyage":"embed_texts_voyag","texts":"text","voyage":"voyag","ai":"ai","embed_cache":"embed_cach","embeddingcache":"embeddingcach","caches":"cach","retrieves":"retriev","avoid":"avoid","recomputation":"recomput","mcp_server":"mcp_server","node_mcp":"node_mcp","js":"js","scripts":"script","quick_token_test":"quick_token_test","netlify_deploy":"netlify_deploy","trigger":"trigger","triggers":"trigger","build":"build","domain":"domain","status":"status","deploy":"deploy","netlify":"netlifi","sites":"site","command":"command","arguments":"argument","guard_legacy_api":"guard_legacy_api","scans":"scan","codebase":"codebas","apis":"api","reports":"report","violations":"violat","measure_overhead":"measure_overhead","test_token_savings":"test_token_sav","eval_gate_guard":"eval_gate_guard","validates":"valid","answers":"answer","ensure":"ensur","contain":"contain","required":"requir","headers":"header","analyze_keywords_v2":"analyze_keywords_v2","test_token_comparison":"test_token_comparison","quick_setup":"quick_setup","write_repos_json":"write_repos_json","updates":"updat","creates":"creat","repositories":"repositori","new":"new","optionally":"option","sets":"set","default":"default","ensure_venv_and_deps":"ensure_venv_and_dep","virtual":"virtual","installs":"instal","measure_token_savings":"measure_token_sav","make_repos_json":"make_repos_json","benchmark_improvements":"benchmark_improv","analyze_keywords":"analyze_keyword","full_comparison":"full_comparison"},"stem_to_sid":{"":0,"serve_rag":1,"py":2,"search":3,"relev":4,"code":5,"locat":6,"without":7,"generat":8,"return":9,"file":10,"path":11,"line":12,"rang":13,"rerank":14,"score":15,"_maybe_init_hf_pipelin":16,"get_rerank":17,"initi":18,"retriev":19,"hug":20,"face":21,"pipelin":22,"text":23,"classif":24,"rank":25,"task":26,"config_load":27,"load_repo":28,"load":29,"repositori":30,"configur":31,"from":32,"json":33,"environ":34,"variabl":35,"choose_repo_from_queri":36,"select":37,"most":38,"base":39,"queri":40,"string":41,"use":42,"keyword":43,"match":44,"app":45,"run":46,"uvicorn":47,"server":48,"rag":49,"applic":50,"set":51,"faxbot_rag":52,"hybrid_search":53,"_get_embed":54,"embed":55,"input":56,"differ":57,"model":58,"_load_cards_map":59,"card":60,"data":61,"jsonl":62,"map":63,"between":64,"indic":65,"chunk":66,"id":67,"metadata":68,"search_routed_multi":69,"snippet":70,"across":71,"multipl":72,"variant":73,"result":74,"_should_index_fil":75,"_prune_dirs_in_plac":76,"filter":77,"out":78,"unwant":79,"directori":80,"index":81,"env_model":82,"eval_loop":83,"run_eval_with_result":84,"evalu":85,"detail":86,"includ":87,"accuraci":88,"metric":89,"hit":90,"inform":91,"main":92,"watch_mod":93,"save_baselin":94,"compare_with_baselin":95,"loop":96,"option":97,"baselin":98,"comparison":99,"watch":100,"capabl":101,"build_card":102,"mcp_server_http":103,"_block":104,"block":105,"legaci":106,"chat":107,"complet":108,"api":109,"usag":110,"redirect":111,"respons":112,"sitecustom":113,"langgraph_app":114,"should_use_multi_queri":115,"retrieve_nod":116,"determin":117,"multi":118,"approach":119,"should":120,"document":121,"question":122,"context":123,"generate_nod":124,"citat":125,"fallback":126,"fallback_nod":127,"provid":128,"when":129,"local":130,"insuffici":131,"answer":132,"build_graph":133,"rewrite_queri":134,"route_after_retriev":135,"build":136,"compil":137,"state":138,"graph":139,"process":140,"condit":141,"rout":142,"redi":143,"checkpoint":144,"eval_rag":145,"perform":146,"compar":147,"expect":148,"actual":149,"golden":150,"dataset":151,"languag":152,"specif":153,"pars":154,"util":155,"analysi":156,"ast_chunk":157,"collect_fil":158,"collect":159,"list":160,"given":161,"root":162,"exclud":163,"specifi":164,"pattern":165,"metadata_enrich":166,"enrich":167,"content":168,"summari":169,"extern":170,"vivified_rag":171,"chat_c":172,"chatc":173,"entri":174,"point":175,"cli":176,"depend":177,"start":178,"interfac":179,"qdrant_recreate_fallback":180,"recreate_collection_saf":181,"qdrantclient":182,"safe":183,"recreat":184,"qdrant":185,"error":186,"handl":187,"index_repo":188,"embed_texts_voyag":189,"voyag":190,"ai":191,"embed_cach":192,"embeddingcach":193,"cach":194,"avoid":195,"recomput":196,"mcp_server":197,"node_mcp":198,"js":199,"script":200,"quick_token_test":201,"netlify_deploy":202,"trigger":203,"domain":204,"status":205,"deploy":206,"netlifi":207,"site":208,"command":209,"argument":210,"guard_legacy_api":211,"scan":212,"codebas":213,"report":214,"violat":215,"measure_overhead":216,"test_token_sav":217,"eval_gate_guard":218,"valid":219,"ensur":220,"contain":221,"requir":222,"header":223,"analyze_keywords_v2":224,"test_token_comparison":225,"quick_setup":226,"write_repos_json":227,"updat":228,"creat":229,"new":230,"default":231,"ensure_venv_and_dep":232,"virtual":233,"instal":234,"measure_token_sav":235,"make_repos_json":236,"benchmark_improv":237,"analyze_keyword":238,"full_comparison":239},"word_to_id":{"":0,"serve_rag":1,"py":2,"search":3,"relevant":4,"code":5,"locations":6,"without":7,"generation":8,"return":9,"file":10,"paths":11,"line":12,"ranges":13,"rerank":14,"scores":15,"_maybe_init_hf_pipeline":16,"get_reranker":17,"initialize":18,"retrieve":19,"hugging":20,"face":21,"pipeline":22,"reranker":14,"text":23,"classification":24,"ranking":25,"tasks":26,"config_loader":27,"load_repos":28,"load":29,"repository":30,"configuration":31,"from":32,"json":33,"environment":34,"variables":35,"choose_repo_from_query":36,"selects":37,"most":38,"based":39,"query":40,"string":41,"using":42,"keyword":43,"matching":44,"app":45,"runs":46,"uvicorn":47,"server":48,"rag":49,"application":50,"configurable":31,"settings":51,"faxbot_rag":52,"hybrid_search":53,"_get_embedding":54,"generates":8,"embeddings":55,"input":56,"different":57,"embedding":55,"models":58,"_load_cards_map":59,"loads":29,"card":60,"data":61,"jsonl":62,"returns":9,"mappings":63,"between":64,"indices":65,"chunk":66,"ids":67,"metadata":68,"search_routed_multi":69,"searches":3,"snippets":70,"across":71,"multiple":72,"variants":73,"reranks":14,"results":74,"_should_index_file":75,"_prune_dirs_in_place":76,"filter":77,"out":78,"unwanted":79,"files":10,"directories":80,"indexing":81,"filtering":77,"env_model":82,"eval_loop":83,"run_eval_with_results":84,"evaluation":85,"detailed":86,"including":87,"accuracy":88,"metrics":89,"hit":90,"information":91,"main":92,"watch_mode":93,"save_baseline":94,"compare_with_baseline":95,"loop":96,"optional":97,"baseline":98,"comparison":99,"watching":100,"capabilities":101,"build_cards":102,"mcp_server_http":103,"_blocked":104,"blocks":105,"legacy":106,"chat":107,"completions":108,"api":109,"usage":110,"redirects":111,"responses":112,"sitecustomize":113,"langgraph_app":114,"should_use_multi_query":115,"retrieve_node":116,"determine":117,"multi":118,"approach":119,"should":120,"used":42,"retrieval":19,"documents":121,"question":122,"context":123,"generate_node":124,"response":112,"citations":125,"fallback":126,"fallback_node":127,"provides":128,"when":129,"local":130,"insufficient":131,"generating":8,"answer":132,"build_graph":133,"rewrite_query":134,"route_after_retrieval":135,"builds":136,"compiles":137,"state":138,"graph":139,"processing":140,"conditional":141,"routing":142,"redis":143,"checkpointer":144,"eval_rag":145,"evaluates":85,"performance":146,"comparing":147,"expected":148,"actual":149,"golden":150,"dataset":151,"language":152,"specific":153,"parsing":154,"utilities":155,"analysis":156,"ast_chunker":157,"collect_files":158,"collects":159,"list":160,"given":161,"root":162,"excluding":163,"specified":164,"patterns":165,"metadata_enricher":166,"enrich":167,"enriches":167,"content":168,"summary":169,"keywords":43,"external":170,"vivified_rag":171,"chat_cli":172,"chatcli":173,"entry":174,"point":175,"cli":176,"initializes":18,"dependencies":177,"starts":178,"interface":179,"qdrant_recreate_fallback":180,"recreate_collection_safe":181,"qdrantclient":182,"safely":183,"recreates":184,"qdrant":185,"collection":159,"error":186,"handling":187,"index_repo":188,"embed_texts_voyage":189,"texts":23,"voyage":190,"ai":191,"embed_cache":192,"embeddingcache":193,"caches":194,"retrieves":19,"avoid":195,"recomputation":196,"mcp_server":197,"node_mcp":198,"js":199,"scripts":200,"quick_token_test":201,"netlify_deploy":202,"trigger":203,"triggers":203,"build":136,"domain":204,"status":205,"deploy":206,"netlify":207,"sites":208,"command":209,"arguments":210,"guard_legacy_api":211,"scans":212,"codebase":213,"apis":109,"reports":214,"violations":215,"measure_overhead":216,"test_token_savings":217,"eval_gate_guard":218,"validates":219,"answers":132,"ensure":220,"contain":221,"required":222,"headers":223,"analyze_keywords_v2":224,"test_token_comparison":225,"quick_setup":226,"write_repos_json":227,"updates":228,"creates":229,"repositories":30,"new":230,"optionally":97,"sets":51,"default":231,"ensure_venv_and_deps":232,"virtual":233,"installs":234,"measure_token_savings":235,"make_repos_json":236,"benchmark_improvements":237,"analyze_keywords":238,"full_comparison":239}}