{"word_to_stem":{"":"","app":"app","exports":"export","from":"from","server":"server","backward":"backward","compatibility":"compat","supports":"support","direct":"direct","run":"run","users":"user","davidmontgomery":"davidmontgomeri","agro":"agro","serve_rag":"serve_rag","py":"py","imports":"import","all":"all","functionalities":"function","rerank":"rerank","module":"modul","retrieval":"retriev","package":"packag","configuration":"configur","settings":"set","common":"common","config":"config","loader":"loader","config_loader":"config_load","preferences_classify_query":"preferences_classify_queri","classifies":"classifi","query":"queri","intent":"intent","based":"base","presence":"presenc","specific":"specif","keywords":"keyword","hybrid_search":"hybrid_search","_project_layer_bonus":"_project_layer_bonus","calculates":"calcul","bonus":"bonus","value":"valu","given":"given","layer":"layer"},"stem_to_sid":{"":0,"app":1,"export":2,"from":3,"server":4,"backward":5,"compat":6,"support":7,"direct":8,"run":9,"user":10,"davidmontgomeri":11,"agro":12,"serve_rag":13,"py":14,"import":15,"all":16,"function":17,"rerank":18,"modul":19,"retriev":20,"packag":21,"configur":22,"set":23,"common":24,"config":25,"loader":26,"config_load":27,"preferences_classify_queri":28,"classifi":29,"queri":30,"intent":31,"base":32,"presenc":33,"specif":34,"keyword":35,"hybrid_search":36,"_project_layer_bonus":37,"calcul":38,"bonus":39,"valu":40,"given":41,"layer":42},"word_to_id":{"":0,"app":1,"exports":2,"from":3,"server":4,"backward":5,"compatibility":6,"supports":7,"direct":8,"run":9,"users":10,"davidmontgomery":11,"agro":12,"serve_rag":13,"py":14,"imports":15,"all":16,"functionalities":17,"rerank":18,"module":19,"retrieval":20,"package":21,"configuration":22,"settings":23,"common":24,"config":25,"loader":26,"config_loader":27,"preferences_classify_query":28,"classifies":29,"query":30,"intent":31,"based":32,"presence":33,"specific":34,"keywords":35,"hybrid_search":36,"_project_layer_bonus":37,"calculates":38,"bonus":39,"value":40,"given":41,"layer":42}}